{"Basic interview questions":
  ["Tell me a little about yourself.",
  "Why did you apply for this job?",
  "What are some of your strengths?",
  "What are a few of your weaknesses?",
  "In your opinion, what is the ideal company?",
  "What makes you want to work for this company?",
  "What makes you the best candidate for this job?",
  "Why should we hire you?",
  "What aspects of your previous job did you like the least?",
  "When were you the most satisfied in your previous position?",
  "Tell me about the responsibilities you held in your last job.",
  "Why are leaving your current employer?",
  "What do you know about our company?",
  "What do you know about our industry?",
  "Would you be willing to travel/relocate?",
  "Do you have any questions for me?",
  "Do you prefer to work independently or with a team?"],
  
  "Salary questions":
  ["If we were to offer you the salary you requested but you had to write your job description for the first year of employment, what would it say?",
  "What have you made as a salary in the past?",
  "What are you hoping to make per year?"],
  
  "Behavioral interview questions":
  ["Tell me about the most difficult decision you have had to make recently. How did you reach a decision?",
  "Have you ever been given an assignment that was too difficult for you? What was your solution and why?",
  "Tell me about an instance when you had to deal with conflict in the workplace.",
  "Give me an example of a time when you made a mistake at work. How did you handle it?",
  "How would you handle a situation where you were required to complete multiple tasks by the end of the day, but it would be impossible to finish all of them?",
  "If you discovered that your company was doing something illegal, like fraud, what would you do?",
  "If, while at a business lunch, you ordered a rare steak but you received one that was well done, how would you react?",
  "Tell me about the most difficult time in your life. How did you get through it?",
  "What would you do if your supervisor asked you to do something that you didn't agree with?",
  "What is your strategy for working with people who annoy you?",
  "Tell me about a time that you failed. What did you learn from it?",
  "How do you approach giving someone difficult feedback?",
  "Have you ever been a part of a team where there is a member not doing their part? How did you react?",
  "Describe a time when your work or performance was criticized.",
  "Tell me about a time when you went above and beyond what was expected of you at work.",
  "Tell me about the last project that you led. What was the final result?",
  "Give me an example of a time that you showed leadership.",
  "How do you manage stress?"],
  
  "Career development questions":
  ["If your previous supervisor were to recommend any additional exposure or training for you, what would they suggest?",
  "If you were hired, what kinds of goals would you initially have?",
  "What are your plans for professional improvement this year?",
  "When it comes to career development, how are you hoping to grow?"],
  
  "Hypothetically hired interview questions":
  ["If you hired for this job, what would your strategy be for the first 90 days?",
  "What would you expect to be doing within the first 30 days of being hired for this job?",
  "How long do you think it would take for you to start making significant contributions in this position?",
  "What would your strategy be for establishing your credibility and earning respect within the team?"],
  
  "Brainteaser questions":
  ["Close your eyes and walk me through each step of tying my shoes.",
  "If you could remove any state in the United States, which would you choose and why?",
  "If you had the opportunity to choose any superpower, what would you choose and why?",
  "Why do tennis balls have fuzz?",
  "What animal would you want to be and why?",
  "Sell me this piece of paper.",
  "Describe ten different uses for a pen other than writing.",
  "Without using a scale, how would you weigh a plane?",
  "How many times do the hands of a clock overlap in 24 hours?"],
  
  "Additional interview questions about you":
  ["Describe your favorite childhood memory.",
  "What do you like to do in your free time?",
  "What kind of things do you do for fun?",
  "Who are your personal heroes and why?",
  "What is the first thing you would do if you were to win the lottery?",
  "What is your favorite movie that you've seen this year?",
  "Do you subscribe to any magazines? If so, which ones?",
  "Tell me about the last book that you read.",
  "If you could travel anywhere in the world right now, where would you go?",
  "What kind of car do you drive?",
  "Describe the difference between exceptional and good.",
  "Tell me something about yourself or your past that you wouldn't want me to know.",
  "How would you rate me as an interviewer?",
  "How would you feel about being more skilled or knowledgeable than your supervisor?",
  "How do you feel about hearing 'no?'",
  "Do you think leaders should be liked or feared?",
  "In your opinion, what makes a good leader?",
  "What qualities make a bad leader?",
  "Outside of your career, what has been your greatest accomplishment?",
  "What will you miss most about your current/previous job?",
  "Why did you choose to major in [x] in college?",
  "What is the most valuable thing that you learned in school?",
  "Tell me about your biggest regret in life.",
  "Describe what you're most fearful of.",
  "Who has had the biggest impact on your career?",
  "If you could only choose five words to describe your character, what would they be?",
  "If you were in my position, what traits would you look for in a candidate for this job?",
  "What are three positive qualities that you don't possess?",
  "What is something negative that your previous employer would say about you?",
  "Tell me three positive things that your previous employer would say about you.",
  "What is your life's mission statement?",
  "Ultimately, what do you hope to achieve and become?",
  "Tell me about your lifelong aspirations.",
  "What do you enjoy doing?",
  "Describe what you are most proud of.",
  "What personality types do you work well with and why?",
  "Is there someone that changed or altered your career path?",
  "How do you feel about your previous employer?",
  "Have you had a favorite supervisor? Why were they your favorite?",
  "Do you see yourself as a detail-oriented person or a big-picture person?",
  "What tools and strategies do you use to stay organized?",
  "Give me an example of a solution you developed or implemented at work.",
  "Do you prefer an entrepreneurial or structured company culture?",
  "Describe your perfect work environment.",
  "What is your work style?"]}